{
"About": {
  "Name": "Cameren Banis",
  "Currently": "Electrical Engineering Student",
  "Headshot": "student-portrait.jpg",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Aloha! I'm Cameren Banis, an Electrical Engineering student passionate about power systems, renewable system design, and control system modeling. Currently I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to gaining experience with power system planning and design and learning how to integrate these skills in community oriented projects. I've worked with Hawaiian Electric Company on overhead and underground distribution projects revolving around grid hardening efforts and wildfire safety. Ouside of class, I am currently conducting research on Kite control units and working on the design and construction of a small microgrid to be installed on campus."
},
"Contact": {
  "EMail": "baniscameren@gmail.com",
  "Phone": "(808) 228-6982",
  "Portfolio": "banis-cameren.github.io",
  "LinkedIn": "https://linkedin.com/in/camerenbanis"
},
"Experience": {
  "ExperienceText": "<br><br>I am a graduate of the class of 2022 at Kamehameha Schools Kapalama and have had an involvement in technical design projects through the robotics program. Through mentorship there I decided to pursue Electrical Engineering in order to become a part of similar projects in the future while also gaining the knowledge and experience to help mentor/inspire students of Hawaii to go into the field. During my time at Seattle Pacific University, I have engaged in various solo and collaborative design projects under the electrical engineering program. Through these experiences I have gained a plethora of analytical skills and learned to work alongside my peers to be able to evaluate and develp educated solutions. Through these projects, essential skills such as learning to operate different types of equipment and picking up new kinds of software. I have also undertaken the school's IEEE program and operate as chair, where I collaborate with industry professionals, professors, and students to help prepare students for the workforce through tech talks, networking events, and design projects. The latest projects being overseen by SPU IEEE is the Micromouse and aritifical intelligence research program. This organization has given me the benefit of being able to attend various equipment trainings and industry related tech talks hosted buy the organizations, giving me plenty of insight into the fields of electrical engineering.<br><br>",
  "School": "Seattle Pacific University",
  "Major": "Electrical Engineering BSc",
  "Graduation": "June 2026",
  "EducationText": "During my time at SPU, I have had the fortunate experience of engaging in numerous hands on design projects. Because of these projects I now have a wide range of skills thast range from electronics designs with PCB CAD software to higher voltage renewable energy systems. These projects have allowed me to devlop essential analysis skills expected of an engineers such as load analysis, safety system integration, system sizing, and control.",
  "Employment": "Hawaiian Electric Company",
  "Role": "Electrical Engineering Design Intern",
  "EmploymentText": "In my internship at Hawaiian Electric Company I was tasked with producing engineering drawings for the reconductoring of 12kV distribution lines, installation of fire-safe fusesand cutouts, and replacement of utility poles. I used O-Calc Pro to utilize company data and on-site measurements to analyze structural performance.",
  "Skills": ["Overhead and underground distribution design", " Microgrid and renewable energy systems design", " OCalc-Pro Line Design", " PCB design", " Embedded systems (Arduino, STM32 NUCLEO)", " LTSpice", " MATLAB", " Excel"],
  "SkillsText": "I’m passionate about applying electrical engineering to build reliable and sustainable energy systems. Through my coursework and experience at Hawaiian Electric, I’ve developed hands-on skills in power distribution design, CAD modeling, and renewable system planning.",
  "Resume/CV": "student-resume.pdf"  
},
"Project1": {
    "Title": "Dual Adjustable Multi-Output Power Supply",
    "Desc": "Student designed power supply device that is able to intake a 120V AC and regulate the power into 5 output stages ranging from -19 to 19V.",
    "GitHubRepo": "https://drive.google.com/file/d/1xwHCbr-n-Y2AmcQTW7YDrQHUGuXXuFoV/view?usp=sharing",
    "MainImage": "PCBM1.png",
    "DetailImages": ["PCBD1.png","PCBD2.png"]
  },
  "Project2": {
    "Title": "Comparative Analysis of Airborne Wind Energy and Conventional Wind Turbines for Microgrid Applications",
    "Desc": "This project was a research paper that my peers and I developed over the span of a quarter researching the novel technologies of airborne wind energy systems. This research aims to demonstrate that airborne wind energy (AWE) has the potential to be a more effective solution than conventional wind turbines for local regions looking to integrate wind power. To support this, we analyzed preexisting wind turbine systems, evaluating their energy production and overall performance to highlight the advantages of AWE.",
    "GitHubRepo": "https://drive.google.com/file/d/1Xegfvb2mr19vJ9_W9s9pvHTolmbh_UWo/view?usp=sharing",
    "MainImage": "PaperM1.png",
    "DetailImages": ["PaperD2.png","PaperD1.png"]
  },
  "Project3": {
    "Title": "Small-scale Airborne Wind Energy Generator",
    "Desc": "This project is the current senior design project of my degree. My team and I are working on designing and building a small scale airborne wind energy system for small scale power applications. My section of this projects development focuses on designing, building, and programming the kite's airborn control system which steers the kite using dual tether lines.",
    "GitHubRepo": "https://drive.google.com/file/d/1ijmJGsLER6oo0GQD7POUi6jsFvPDZWpR/view?usp=sharing",
    "MainImage": "SystemDesign_edited.png",
    "DetailImages": ["AWEPic1"]
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
