{
"About": {
  "Name": "Cameren Banis",
  "Currently": "Electrical Engineering Student",
  "Headshot": "student-portrait.jpg",
  "Thumbnail": "student-logo.webp",
  "AboutText": "Aloha! I'm Cameren Banis, an Electrical Engineering student passionate about power systems, renewable system design, and control system modeling. Currently I am pursuing my undergraduate degree at Seattle Pacific University. I am dedicated to gaining experience with power system planning and design and learning how to integrate these skills in community oriented projects. I've worked with Hawaiian Electric Company on overhead and underground distribution projects revolving around grid hardening efforts and wildfire safety. Outside of class, I am currently conducting research on Kite control units and working on the design and construction of a small microgrid to be installed on campus."
},
"Contact": {
  "EMail": "baniscameren@gmail.com",
  "Phone": "(808) 228-6982",
  "Portfolio": "banis-cameren.github.io",
  "LinkedIn": "https://linkedin.com/in/camerenbanis"
},
"Experience": {
  "ExperienceText": "<br><br>During my time at Seattle Pacific University, I have developed a strong foundation in electrical engineering through hands-on coursework, research, and leadership in the engineering community. I have had the opportunity to work on a wide range of hands-on engineering projects that strengthened my technical foundation. These include designing multi-stage power supply systems, developing embedded controllers using Arduino and STM32 platforms, and building renewable-energy prototypes such as a small microgrid and an airborne wind energy generator. Through these projects, I gained experience in circuit analysis, PCB design, system modeling, and control strategies, while learning to integrate safety considerations and real-world engineering constraints into my work. During my engineering internship at Hawaiian Electric Company, I gained hands-on experience in utility distribution design and contributed directly to Oahu’s ongoing grid-hardening and wildfire-mitigation efforts. I collaborated with Transmission & Distribution engineers to model utility poles, assess structural loading, and develop design solutions using CAD tools and company databases. My work included producing full-scale engineering drawings for the reconductoring of 12kV distribution lines, the installation of fire-safe fuses and cutouts, and the replacement of aging infrastructure along high-risk corridors. Throughout the design process, I applied National Electrical Safety Code (NESC) standards, performed land rights research, and resolved pole-loading failures through iterative engineering analysis. This internship strengthened my understanding of real-world utility engineering, deepened my technical proficiency in distribution systems, and reinforced my passion for designing resilient, community-centered electrical infrastructure.<br><br>",
  "School": "Seattle Pacific University",
  "Major": "Electrical Engineering BSc",
  "Graduation": "June 2026",
  "EducationText": "During my time at SPU, I have had the fortunate experience of engaging in numerous hands on design projects. Because of these projects I now have a wide range of skills thast range from electronics designs with PCB CAD software to higher voltage renewable energy systems. These projects have allowed me to devlop essential analysis skills expected of an engineers such as load analysis, safety system integration, system sizing, and control.",
  "Employment": "Hawaiian Electric Company",
  "Role": "Electrical Engineering Design Intern",
  "EmploymentText": "In my internship at Hawaiian Electric Company I was tasked with producing engineering drawings for the reconductoring of 12kV distribution lines, installation of fire-safe fusesand cutouts, and replacement of utility poles. I used O-Calc Pro to utilize company data and on-site measurements to analyze structural performance.",
  "Skills": ["Overhead and underground distribution design", " Microgrid and renewable energy systems design", " OCalc-Pro Line Design", " PCB design", " Embedded systems (Arduino, STM32 NUCLEO)", " LTSpice", " MATLAB", " Excel"],
  "SkillsText": "I’m passionate about applying electrical engineering to build reliable and sustainable energy systems. Through my coursework and experience at Hawaiian Electric, I’ve developed hands-on skills in power distribution design, CAD modeling, and renewable system planning.",
  "Resume/CV": "student-resume.pdf"  
},
"Project1": {
    "Title": "Dual Adjustable Multi-Output Power Supply",
    "Desc": "Student designed power supply device that is able to intake a 120V AC and regulate the power into 5 output stages ranging from -19 to 19V.",
    "GitHubRepo": "https://drive.google.com/file/d/1xwHCbr-n-Y2AmcQTW7YDrQHUGuXXuFoV/view?usp=sharing",
    "MainImage": "PCBM1.png",
    "DetailImages": ["PCBD1.png","PCBD2.png"]
  },
  "Project2": {
    "Title": "Comparative Analysis of Airborne Wind Energy and Conventional Wind Turbines for Microgrid Applications",
    "Desc": "This project was a research paper that my peers and I developed over the span of a quarter researching the novel technologies of airborne wind energy systems. This research aims to demonstrate that airborne wind energy (AWE) has the potential to be a more effective solution than conventional wind turbines for local regions looking to integrate wind power. To support this, we analyzed preexisting wind turbine systems, evaluating their energy production and overall performance to highlight the advantages of AWE.",
    "GitHubRepo": "https://drive.google.com/file/d/1Xegfvb2mr19vJ9_W9s9pvHTolmbh_UWo/view?usp=sharing",
    "MainImage": "PaperM1.png",
    "DetailImages": ["PaperD2.png","PaperD1.png"]
  },
  "Project3": {
    "Title": "Small-scale Airborne Wind Energy Generator",
    "Desc": "This project is the current senior design project of my degree. My team and I are working on designing and building a small scale airborne wind energy system for small scale power applications. My section of this projects development focuses on designing, building, and programming the kite's airborn control system which steers the kite using dual tether lines.",
    "GitHubRepo": "https://drive.google.com/file/d/1ijmJGsLER6oo0GQD7POUi6jsFvPDZWpR/view?usp=sharing",
    "MainImage": "SystemDesign_edited.png",
    "DetailImages": ["AWEPic1"]
  },
  "Project4": {
    "Title": "",
    "Desc": "",
    "GitHubRepo": "",
    "MainImage": "",
    "DetailImages": []
  }
}
